       identification division.
       program-id. HelloLib.

       procedure division.
           DisplayHelloWorld.
               display "Hello, World! from COBOL Library."
               goback.
